Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `quarkus-resteasy-client-oidc-token-propagation` extension provides two Jakarta REST `jakarta.ws.rs.client.ClientRequestFilter` class implementations that simplify the propagation of authentication information. `io.quarkus.oidc.token.propagation.AccessTokenRequestFilter` propagates the xref:security-oidc-bearer-token-authentication.adoc[Bearer token] present in the current active request or the token acquired from the xref:security-oidc-code-flow-authentication.adoc[Authorization code flow mechanism], as the HTTP `Authorization` header's `Bearer` scheme value. The `io.quarkus.oidc.token.propagation.JsonWebTokenRequestFilter` provides the same functionality but, in addition, provides support for JWT tokens.
ja_jp: `quarkus-resteasy-client-oidc-token-propagation` エクステンションは、認証情報の伝播を簡素化する 2 つの Jakarta REST `jakarta.ws.rs.client.ClientRequestFilter` クラス実装を提供します。 `io.quarkus.oidc.token.propagation.AccessTokenRequestFilter` は、現在アクティブなリクエストに存在する xref:security-oidc-bearer-token-authentication.adoc[Bearer token] または xref:security-oidc-code-flow-authentication.adoc[Authorization code flow mechanism] から取得したトークンを、HTTP `Authorization` ヘッダーの `Bearer` スキーム値として伝播します。 `io.quarkus.oidc.token.propagation.JsonWebTokenRequestFilter` は同じ機能を提供しますが、さらに JWT トークンのサポートも提供します。

source: The `quarkus-resteasy-client-oidc-token-propagation` extension requires the `quarkus-oidc` extension. It provides Jakarta REST `TokenCredentialRequestFilter`, which sets the OpenID Connect Bearer token or Authorization Code Flow access token as the `Bearer` scheme value of the HTTP `Authorization` header. This filter can be registered with MicroProfile REST client implementations injected into the current Quarkus endpoint, which must be protected by using the Quarkus OIDC adapter. This filter can propagate the access token to the downstream services.
ja_jp: `quarkus-resteasy-client-oidc-token-propagation` エクステンションには `quarkus-oidc` エクステンションが必要です。 これは、OpenID Connect ベアラートークンまたは認可コードフローアクセストークンを HTTP `Authorization` ヘッダーの `Bearer` スキーム値として設定する Jakarta REST `TokenCredentialRequestFilter` を提供します。 このフィルターは、現在の Quarkus エンドポイントに注入された MicroProfile REST クライアント実装に登録できます。これは、Quarkus OIDC アダプターを使用して保護する必要があります。 このフィルターは、アクセストークンをダウンストリームサービスに伝播できます。

source: The `quarkus-resteasy-mutiny` does not have a corresponding dependency, as Quarkus REST provides Mutiny integration out of the box.
ja_jp: `quarkus-resteasy-mutiny` は、Quarkus REST が Mutiny のインテグレーションを最初から提供するため、対応する依存関係がありません。

source: The `quarkus-resteasy-mutiny` does not have a corresponding dependency, as RESTEasy Reactive provides Mutiny integration out of the box.
ja_jp: `quarkus-resteasy-mutiny` は、RESTEasy Reactive が Mutiny の統合を最初から提供するため、対応する依存関係がありません。

source: The `quarkus-resteasy-reactive` extension supports Kotlin `suspend fun` ctions in combination with `quarkus-kotlin` as well:
ja_jp: `quarkus-resteasy-reactive` エクステンションは、 `quarkus-kotlin` との組み合わせで Kotlin `suspend fun` ctions もサポートしています:

source: The `quarkus-security-jpa` extension initializes only if a single entity is annotated with `@UserDefinition`.
ja_jp: `quarkus-security-jpa` エクステンションは、単一のエンティティが `@UserDefinition` でアノテートされている場合にのみ初期化されます。

source: The `quarkus-security-jpa` extension only initializes if a single entity is annotated with `@UserDefinition`.
ja_jp: `quarkus-security-jpa` エクステンションは、単一のエンティティーに `@UserDefinition` アノテーションが付けられている場合にのみ初期化されます。

source: The `quarkus-smallrye-graphql` extension will expose the GraphQL UI when Quarkus is running in dev mode. More details can be found in the xref:smallrye-graphql.adoc#ui[Graphql guide].
ja_jp: `quarkus-smallrye-graphql` エクステンションは、Quarkus が開発モードで実行されている場合に GraphQL UI を公開します。詳細は xref:smallrye-graphql.adoc#ui[Graphql ガイド] を参照してください。

source: The `quarkus-smallrye-graphql` extension will expose the GraphQL UI when Quarkus is running in dev mode. More details can be found xref:smallrye-graphql.adoc#ui[here].
ja_jp: `quarkus-smallrye-graphql` エクステンションは、Quarkus が開発モードで動作しているときに GraphiQL UI を公開します。詳細は link:smallrye-graphql.html#ui[こちら] をご覧ください。

source: The `quarkus-smallrye-graphql` extension will expose the GraphiQL UI when Quarkus is running in dev mode. More details can be found xref:smallrye-graphql.adoc#ui[here].
ja_jp: `quarkus-smallrye-graphql` エクステンションは、Quarkus が開発モードで動作しているときに、GraphiQL UI を公開します。追加情報は xref:smallrye-graphql.adoc#ui[こちら] をご覧ください。

source: The `quarkus-smallrye-graphql` extension will expose the GraphiQL UI when Quarkus is running in dev-mode. More details can be found xref:smallrye-graphql.adoc#ui[here].
ja_jp: `quarkus-smallrye-graphql` エクステンションは、Quarkusがdev-modeで動作しているときにGraphiQL UIを公開します。詳細は link:smallrye-graphql.html#ui[こちら]をご覧ください。

source: The `quarkus-smallrye-health` extension will expose the Health UI when Quarkus is running in dev mode. The xref:smallrye-health.adoc#ui[Healthcheck] section provides additional information.
ja_jp: `quarkus-smallrye-health` エクステンションは、Quarkus が開発モードで実行されている場合に Health UI を公開します。 xref:smallrye-health.adoc#ui[ヘルスチェック] セクションで追加情報を提供しています。

source: The `quarkus-smallrye-health` extension will expose the Health UI when Quarkus is running in dev mode. xref:smallrye-health.adoc#ui[This] section provides additional information.
ja_jp: `quarkus-smallrye-health` エクステンションは、Quarkus が開発モードで動作しているときに Health UI を公開します。link:smallrye-health.html#ui[こちら] のセクションでは、追加情報を提供します。

source: The `quarkus-smallrye-health` extension will expose the Health UI when Quarkus is running in dev-mode. xref:smallrye-health.adoc#ui[This] section provides additional information.
ja_jp: `quarkus-smallrye-health` エクステンションは、Quarkusがdev-modeで動作しているときにHealth UIを公開します。 link:smallrye-health.html#ui[この]セクションでは、追加情報を提供します。

source: The `quarkus-smallrye-jwt` extension provides a MicroProfile JSON Web Token (JWT) 1.2.1 implementation and multiple options to verify signed and encrypted `JWT` tokens and represents them as `org.eclipse.microprofile.jwt.JsonWebToken`.
ja_jp: `quarkus-smallrye-jwt` エクステンションは、MicroProfile JSON Web Token (JWT) 1.2.1 の実装と、署名および暗号化された `JWT` トークンを検証する複数のオプションを提供し、それらを `org.eclipse.microprofile.jwt.JsonWebToken` として表します。

source: The `quarkus-smallrye-jwt` extension provides a MicroProfile JSON Web Token (JWT) 2.1 implementation and multiple options to verify signed and encrypted `JWT` tokens. It represents them as `org.eclipse.microprofile.jwt.JsonWebToken`.
ja_jp: `quarkus-smallrye-jwt` エクステンションは、MicroProfile JSON Web Token (JWT) 2.1 の実装と、署名および暗号化された `JWT` トークンを検証する複数のオプションを提供します。 これらは `org.eclipse.microprofile.jwt.JsonWebToken` として表されます。

source: The `quarkus-smallrye-openapi` extension saves the OpenAPI Document to a file when the `quarkus.smallrye-openapi.store-schema-directory` is configured. This saved version of the OpenAPI Document is useful for downstream consumers.
ja_jp: `quarkus-smallrye-openapi` エクステンションは、`quarkus.smallrye-openapi.store-schema-directory` が設定されている場合、OpenAPI ドキュメントをファイルに保存します。この保存されたバージョンの OpenAPI ドキュメントは、ダウンストリームのコンシューマーにとって有用です。

source: The `quarkus-smallrye-openapi` extension will expose the Swagger UI when Quarkus is running in dev mode. Additional information can be found in the xref:openapi-swaggerui.adoc#dev-mode[Swagger UI guide].
ja_jp: `quarkus-smallrye-openapi` エクステンションは、Quarkus が開発モードで実行されている場合に Swagger UI を公開します。追加情報は xref:openapi-swaggerui.adoc#dev-mode[Swagger UI ガイド] を参照してください。

source: The `quarkus-smallrye-openapi` extension will expose the Swagger UI when Quarkus is running in dev mode. Additional information can be found xref:openapi-swaggerui.adoc#dev-mode[here].
ja_jp: `quarkus-smallrye-openapi` エクステンションは、Quarkus が開発モードで動作しているときに、Swagger UI を公開します。追加情報は link:openapi-swaggerui.html#dev-mode[こちら] をご覧ください。

source: The `quarkus-smallrye-openapi` extension will expose the Swagger UI when Quarkus is running in dev-mode. Additional information can be found xref:openapi-swaggerui.adoc#dev-mode[here].
ja_jp: `quarkus-smallrye-openapi` エクステンションは、Quarkusがdev-modeで動作しているときに、Swagger UIを公開します。追加情報は link:openapi-swaggerui.html#dev-mode[こちら]をご覧ください。

source: The `quarkus-test-oidc-server` extension includes a signing RSA private key file in a `JSON Web Key` (`JWK`) format and points to it with a `smallrye.jwt.sign.key.location` configuration property. It allows you to sign the token by using a no-argument `sign()` operation.
ja_jp: `quarkus-test-oidc-server` エクステンションは、 `JSON Web Key` (`JWK`) フォーマットの署名 RSA 秘密鍵ファイルを含んでおり、 `smallrye.jwt.sign.key.location` 設定プロパティーでそのファイルを参照します。 このエクステンションを使用すると、引数なしの `sign()` 操作を使用してトークンに署名できます。

source: The `quarkus-test-vertx` dependency provides the `@io.quarkus.test.vertx.RunOnVertxContext` annotation and the `io.quarkus.test.vertx.UniAsserter` class which are intended precisely for this purpose. The usage is described in the xref:hibernate-reactive.adoc#testing[Hibernate Reactive] guide.
ja_jp: `quarkus-test-vertx` 依存関係は、まさにこの目的のために `@io.quarkus.test.vertx.RunOnVertxContext` アノテーションと `io.quarkus.test.vertx.UniAsserter` クラスを提供します。使用方法は、 xref:hibernate-reactive.adoc#testing[Hibernate Reactive] ガイドに記載されています。

source: The `quarkus-test-vertx` dependency provides the `@io.quarkus.test.vertx.RunOnVertxContext` annotation, which when used on a test method, executes the test on a Vert.x context.
ja_jp: `quarkus-test-vertx` 依存関係は `@io.quarkus.test.vertx.RunOnVertxContext` アノテーションを提供します。これをテストメソッドで使用すると、Vert.x コンテキストでテストが実行されます。

source: The `quarkus-websockets-next` extension provides a modern declarative API to define WebSocket server and client endpoints.
ja_jp: `quarkus-websockets-next` エクステンションは、WebSocket サーバーおよびクライアントエンドポイントを定義するための最新の宣言型 API を提供します。

source: The `quarkus-websockets-next` extension provides a modern, efficient implementation of the WebSocket API. It also provides an integration with Quarkus security. For more information, see the xref:websockets-next-reference.adoc#websocket-next-security[Security] section of the Quarkus "WebSockets Next reference" guide.
ja_jp: `quarkus-websockets-next` エクステンションは、WebSocket API の最新かつ効率的な実装を提供します。 また、Quarkus セキュリティーとのインテグレーションも提供します。 詳細は、Quarkus「WebSockets Next リファレンス」ガイドの xref:websockets-next-reference.adoc#websocket-next-security[セキュリティー] セクションを参照してください。

source: The `quarkus.artemis.enabled` property is a build-time setting that must be set to `true` for the `ConnectionFactory` bean to be created. Without it, the extension will not produce a `ConnectionFactory` and injection will fail with an `UnsatisfiedResolutionException`.
ja_jp: `quarkus.artemis.enabled` プロパティーは、`ConnectionFactory` Bean が作成されるために `true` に設定する必要があるビルド時の設定です。これがないと、エクステンションは `ConnectionFactory` を生成せず、インジェクションは `UnsatisfiedResolutionException` で失敗します。

source: The `quarkus.config.locations` configuration property accepts multiple locations separated by a comma `,` and each must represent a valid `URI`. The supported `URI` schemes are:
ja_jp: `quarkus.config.locations` 設定プロパティーは、コンマ `,` で区切られた複数の場所を受け入れます。 場所は、それぞれ有効な `URI` を表す必要があります。サポートされている `URI` スキームは次のとおりです。

source: The `quarkus.container-image.registry` contains the container registry to use. The `quarkus.kubernetes.ingress.expose` indicates that the service will be accessible from the outside of the cluster. The `quarkus.kubernetes.ingress.host` contains the url to access the service. We are using https://nip.io/[nip.io] wildcard for IP address mappings.
ja_jp: `quarkus.container-image.registry` には、使用するコンテナーレジストリーが含まれています。 `quarkus.kubernetes.ingress.expose` は、サービスがクラスターの外部からアクセスできることを示します。 `quarkus.kubernetes.ingress.host` には、サービスにアクセスするための URL が含まれています。IP アドレスのマッピングには https://nip.io/[nip.io] ワイルドカードを使用しています。

source: The `quarkus.google-cloud-functions.function` property tells Quarkus which function to deploy. This can be overridden with an environment variable too.
ja_jp: `quarkus.google-cloud-functions.function` プロパティーは、デプロイする関数をQuarkusに伝えます。これは環境変数でオーバーライドすることもできます。

source: The `quarkus.grpc.clients.hello.host` property must be set.
ja_jp: `quarkus.grpc.clients.hello.host` プロパティを設定する必要があります。

source: The `quarkus.grpc.codegen.skip` property in your `application.properties` file: `quarkus.grpc.codegen.skip=true`
ja_jp: `application.properties` ファイルの `quarkus.grpc.codegen.skip` プロパティー: `quarkus.grpc.codegen.skip=true`

source: The `quarkus.http.http2-connection-window-size` property sets the HTTP/2 connection window size in bytes. The default value is `-1`, which reuses the initial window size setting (typically 64KB). For large messages, increasing this value can significantly improve throughput.
ja_jp: `quarkus.http.http2-connection-window-size` プロパティーは、HTTP/2 接続ウィンドウサイズをバイト単位で設定します。デフォルト値は `-1` であり、これは初期ウィンドウサイズ設定 (通常 64KB) を再利用します。大容量メッセージの場合、この値を増やすとスループットが大幅に向上する可能性があります。

source: The `quarkus.http.insecure-requests` property is used to disable insecure requests.
ja_jp: `quarkus.http.insecure-requests` プロパティーは、安全ではないリクエストを無効にするために使用されます。

source: The `quarkus.http.root-path` configuration property changes the xref:http-reference.adoc#context-path[http endpoint context path].
ja_jp: `quarkus.http.root-path` 設定プロパティは、 xref:http-reference.adoc#context-path[http endpoint context path] を変更します。

source: The `quarkus.http.root-path` configuration property is used to change the xref:http-reference.adoc#context-path[http endpoint context path].
ja_jp: `quarkus.http.root-path` 設定プロパティは、 link:http-reference.html#context-path[http エンドポイントコンテキストパス] を変更するために使用されます。

source: The `quarkus.http.root-path` property is only applied to the main HTTP server and not to the management interface. In addition, the `quarkus.http.non-application-root-path` property is not used for endpoint exposed on the management interface.
ja_jp: `quarkus.http.root-path` プロパティは、メインの HTTP サーバーにのみ適用され、マネジメントインタフェースには適用されません。また、 `quarkus.http.non-application-root-path` プロパティは、マネジメントインタフェース上で公開されるエンドポイントには使用されません。

source: The `quarkus.http.static-dir.endpoint` value must not contain `*` or `..`, and it will be normalized to avoid trailing slashes. Similarly, `quarkus.http.static-dir.path` must be a relative path without `..`. Quarkus validates these values at build time.
ja_jp: `quarkus.http.static-dir.endpoint` の値には `*` や `..` を含めることはできず、末尾のスラッシュを避けるために正規化されます。同様に、 `quarkus.http.static-dir.path` は `..` を含まない相対パスである必要があります。Quarkus はビルド時にこれらの値を検証します。

source: The `quarkus.jib.jvm-entrypoint` configuration property can be used to completely override the container entry point and can thus be used to either hard code the JVM debug configuration or point to a script that handles the details.
ja_jp: 最後に、 `quarkus.jib.jvm-entrypoint` 設定プロパティを使用すると、コンテナのエントリポイントを完全にオーバーライドすることができるため、JVMのデバッグ構成をハードコードするか、詳細を処理するスクリプトを指定することができます。

source: The `quarkus.lambda.handler` property tells Quarkus which lambda handler to deploy. This can be overridden with an environment variable too.
ja_jp: `quarkus.lambda.handler` プロパティーは、デプロイする Lambda ハンドラーをQuarkusに伝えます。これは環境変数でオーバーライドすることもできます。

source: The `quarkus.mailer.auth-methods` configuration option is needed for the Quarkus mailer to support password authentication with Gmail. By default both the mailer and Gmail default to `XOAUTH2` which requires registering an application, getting tokens, etc.
ja_jp: `quarkus.mailer.auth-methods` 設定オプションは、QuarkusのMailerがGmailでパスワード認証をサポートするために必要です。デフォルトでは、MailerとGmailの両方が `XOAUTH2` 、アプリケーションの登録やトークンの取得などが必要になります。

source: The `quarkus.mailer.auth-methods` configuration option is needed for the Quarkus mailer to support password authentication with Gmail. By default, both the mailer and Gmail default to `XOAUTH2` which requires registering an application, getting tokens, etc.
ja_jp: Quarkus Mailer が Gmailでのパスワード認証をサポートするには、 `quarkus.mailer.auth-methods` 設定オプションが必要です。 Mailer と Gmail の両方が `XOAUTH2` をデフォルトとしており、アプリケーションの登録やトークンの取得などが必要です。

source: The `quarkus.mongodb.database` property will be used by MongoDB with Panache to determine the name of the database where your entities will be persisted (if not overridden by `@MongoEntity`).
ja_jp: `quarkus.mongodb.database` プロパティは、MongoDB with Panache でエンティティを永続化するデータベースの名前を決定するのに使われます（ `@MongoEntity` でオーバーライドされていない場合）。

source: The `quarkus.oidc.application-type` is set to `service`, the default value, or `hybrid`.
ja_jp: `quarkus.oidc.application-type` が、デフォルト値の `service` または `hybrid` に設定されている。

source: The `quarkus.oidc.application-type` property is set to `web-app` in order to tell Quarkus that you want to enable the OIDC authorization code flow, so that your users are redirected to the OIDC provider to authenticate.
ja_jp: OIDC認可コードフローを有効にすることで、ユーザーがOIDCプロバイダーにリダイレクトされて認証されるようQuarkusを設定するために、 `quarkus.oidc.application-type` プロパティは `web-app` に設定されています。

source: The `quarkus.oidc.application-type` property is set to `web-app` in order to tell Quarkus that you want to enable the OpenID Connect Authorization Code Flow, so that your users are redirected to the OpenID Connect Provider to authenticate.
ja_jp: OpenID Connect 認可コードフローを有効にしたいことをQuarkusに伝えるために、 `quarkus.oidc.application-type` プロパティーは、 `web-app` に設定します。これにより、ユーザーが認証のためにOpenID Connect Providerにリダイレクトされます。

source: The `quarkus.oidc.application-type` property is set to `web-app` to tell Quarkus that you want to enable the OIDC authorization code flow so that your users are redirected to the OIDC provider to authenticate.
ja_jp: `quarkus.oidc.application-type` プロパティを `web-app` に設定することで、OIDC認可コードフローを有効にし、ユーザーが認証のためにOIDCプロバイダにリダイレクトされるようにQuarkusに指示します。

source: The `quarkus.oidc.auth-server-url` points to an already started OpenID Connect provider, which can be Keycloak or other provider.
ja_jp: `quarkus.oidc.auth-server-url` が、すでに起動している OpenID Connect プロバイダー (Keycloak またはその他のプロバイダー) を指している。

source: The `quarkus.oidc.authentication.forward-params` map parameter can be used to choose which of the original user request URL's query parameters are included in the redirect URI that Quarkus creates before redirecting the user to authenticate. Use this property with care.
ja_jp: `quarkus.oidc.authentication.forward-params` マップパラメーターを使用すると、ユーザーを認証にリダイレクトする前に Quarkus が作成するリダイレクト URI に、元のユーザーリクエスト URL のクエリーパラメーターのうちどれを含めるかを選択できます。このプロパティーの使用には注意が必要です。

source: The `quarkus.oidc.client-id` is set.
ja_jp: `quarkus.oidc.client-id` が設定されている。

source: The `quarkus.oidc.client-id` property identifies the OIDC client that requested the current bearer token. The OIDC client can be an SPA application running in a browser or a Quarkus `web-app` confidential client application propagating the access token to the Quarkus `service` application.
ja_jp: `quarkus.oidc.client-id` プロパティーは、現在のベアラートークンをリクエストした OIDC クライアントを特定します。 OIDC クライアントは、ブラウザーで実行される SPA アプリケーション、または Quarkus `service` アプリケーションにアクセストークンを伝播する Quarkus `web-app` 機密クライアントアプリケーションです。

source: The `quarkus.oidc.client-id` property references the `client_id` issued by the OIDC provider and the `quarkus.oidc.credentials.secret` property sets the client secret.
ja_jp: `quarkus.oidc.client-id` プロパティは、OIDC プロバイダーが発行する `client_id` を参照し、 `quarkus.oidc.credentials.secret` プロパティは、クライアントシークレットを設定します。

source: The `quarkus.oidc.client-id` property references the `client_id` issued by the OIDC provider, and the `quarkus.oidc.credentials.secret` property sets the client secret.
ja_jp: `quarkus.oidc.client-id` プロパティは OIDC プロバイダが発行した `client_id` を参照し、 `quarkus.oidc.credentials.secret` プロパティはクライアントシークレットを設定します。

source: The `quarkus.oidc.client-id` property references the `client_id` issued by the OpenID Connect Provider and the `quarkus.oidc.credentials.secret` property sets the client secret.
ja_jp: `quarkus.oidc.client-id` プロパティーは OpenID Connect プロバイダーが発行した `client_id` を参照し、 `quarkus.oidc.credentials.secret` プロパティーはクライアントの秘密を設定します。

source: The `quarkus.oidc.credentials.secret` client secret property was already introduced in the previous <<client-id-secret>> section and using this property alone maybe sufficient to authenticate to many OIDC and OAuth2 compliant providers.
ja_jp: `quarkus.oidc.credentials.secret` クライアントシークレットプロパティーは前の <<client-id-secret>> セクションで既に紹介しましたが、多くの OIDC および OAuth2 準拠のプロバイダーで認証するには、このプロパティーのみで十分な場合があります。

source: The `quarkus.oidc.proxy.proxy-configuration-name=<name>` property configures the name of proxy configuration registered in the Proxy registry (`quarkus.proxy.<name>.*`). The proxy configuration can be used to control OIDC access to HTTP proxies.
ja_jp: `quarkus.oidc.proxy.proxy-configuration-name=<name>` プロパティーは、プロキシーレジストリー (`quarkus.proxy.<name>.*`) に登録されたプロキシー設定の名前を設定します。このプロキシー設定を使用して、HTTP プロキシーへの OIDC アクセスを制御できます。

source: The `quarkus.oidc.token-state-manager.encryption-secret` enables the default token state manager to encrypt the user tokens in a browser cookie. If this key is not defined, and the `quarkus.oidc.credentials.secret` fallback is not configured, Quarkus uses a random key. A random key causes existing logins to be invalidated either on application restart or in environment with multiple instances of your application. Alternatively, encryption can also be disabled by setting `quarkus.oidc.token-state-manager.encryption-required` to `false`. However, you should disable secret encryption in development environments only.
ja_jp: `quarkus.oidc.token-state-manager.encryption-secret` を使用すると、デフォルトのトークンステートマネージャが、ブラウザクッキー内のユーザートークンを暗号化できるようになります。 このキーが定義されておらず、 `quarkus.oidc.credentials.secret` フォールバックが設定されていない場合、Quarkus はランダムキーを使用します。ランダムキーを使用すると、アプリケーションの再起動時や、アプリケーションの複数のインスタンスがある環境で、既存のログインが無効になります。また、 `quarkus.oidc.token-state-manager.encryption-required` を `false` に設定することで、暗号化を無効にすることもできます。ただし、シークレットの暗号化は開発環境でのみ無効にしてください。

source: The `quarkus.oidc.token.refresh-token` property is automatically enabled if the `quarkus.oidc.token.refresh-token-time-skew` property is configured.
ja_jp: `quarkus.oidc.token.refresh-token` プロパティーは、`quarkus.oidc.token.refresh-token-time-skew` プロパティーが設定されている場合、自動的に有効になります。

source: The `quarkus.otel.exporter.otlp.endpoint` property is automatically set to the OTel collector endpoint as seen from the outside of the Docker container.
ja_jp: `quarkus.otel.exporter.otlp.endpoint` プロパティーは、Docker コンテナーの外部から見える OTel コレクターエンドポイントに自動的に設定されます。

source: The `quarkus.otel.exporter.otlp.protocol` defaults to `grpc` but `http/protobuf` can also be used.
ja_jp: `quarkus.otel.exporter.otlp.protocol` のデフォルトは `grpc` ですが、 `http/protobuf` も使用できます。

source: The `quarkus.otel.exporter.otlp.protocol` is set to `http/protobuf`.
ja_jp: `quarkus.otel.exporter.otlp.protocol` は `http/protobuf` に設定されています。

source: The `quarkus.otel.exporter.otlp.protocol` property instructs Quarkus to switch the senders and defaults to `grpc` but `http/protobuf` can also be used.
ja_jp: `quarkus.otel.exporter.otlp.protocol` プロパティーは、Quarkus に送信者を切り替えるように指示し、デフォルトでは `grpc` に設定されますが、`http/protobuf` も使用できます。

source: The `quarkus.package.jar.aot.phase` configuration controls when training occurs:
ja_jp: `quarkus.package.jar.aot.phase` 設定プロパティーでトレーニングが行われるタイミングを制御します。

source: The `quarkus.security.users.file.users` configuration property specifies a classpath resource which is a properties file with a user to password mapping, one per line. The following <<test-users-example>> illustrates the format:
ja_jp: `quarkus.security.users.file.users` 設定プロパティーは、クラスパスリソースを指定します。これは、1行に1つずつ、ユーザーとパスワードをマッピングしたプロパティーファイルです。以下の link:#test-users-example[test-users-example] はそのフォーマットを示しています:

source: The `quarkus.security.users.file.users` configuration property specifies a classpath resource which is a properties file with a user-to-password mapping, one per line.
ja_jp: `quarkus.security.users.file.users` 設定プロパティは、ユーザーとパスワードのマッピングを1行に1つずつ記述したプロパティファイルであるクラスパスリソースを指定します。

source: The `quarkus.smallrye-openapi.always-run-filter` configuration property is deprecated. Annotate your filters with `@OpenApiFilter(stages = OpenApiFilter.RunStage.RUNTIME_PER_REQUEST)` instead.
ja_jp: `quarkus.smallrye-openapi.always-run-filter` 設定プロパティーは非推奨です。代わりに、フィルターに `@OpenApiFilter(stages = OpenApiFilter.RunStage.RUNTIME_PER_REQUEST)` を付けてください。
